{
  "backend/main.mo": "Main Motoko actor for a clothing e-commerce backend that manages products and per-user shopping carts, with functions to add products, initialize 20+ default clothing items, and handle cart operations.",
  "backend/migration.mo": "Migration module that transforms old product/cart data (simple Nat price, no brand/category/sizes) into the new schema with Float price, brand, category, sizes, and rating fields.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (clothing catalog, filtering/search, product detail modal, clothing-specific cart) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the app's component structure and responsibilities.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the StyleMart app, setting the page title, meta description, and importing Nunito and Inter fonts from Google Fonts.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for catalog, cart, checkout, and order confirmation pages, all wrapped in a shared Layout with Header and Footer.",
  "frontend/src/components/Cart.tsx": "Shopping cart component displaying cart items in a two-column layout with a price summary panel showing item count, total, free delivery, and a Place Order button.",
  "frontend/src/components/CartItem.tsx": "Renders a single cart item with product image, name, size, price, and discount info, plus controls to increase/decrease quantity or remove the item using cart mutation hooks.",
  "frontend/src/components/CategoryFilter.tsx": "Displays a horizontal scrollable list of category filter buttons (All, Men, Women, Kids, Accessories) and highlights the currently selected one.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with brand info, shop links, help links, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with the StyleMart logo, desktop nav link, cart icon with item count badge, and a mobile slide-out menu sheet.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, brand, name, star rating, price, and optional discount badge; triggers an onClick callback when clicked.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal dialog showing full product details (image, description, rating, price, sizes) with a size selector and an Add to Cart button that calls the addToCart mutation.",
  "frontend/src/components/ProductGrid.tsx": "Fetches and displays a responsive grid of ProductCards, auto-initializes products if none exist, and shows skeleton loaders or empty-state messages as needed.",
  "frontend/src/components/SearchBar.tsx": "Controlled search input with a search icon and a clear (X) button that resets the value.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and React provider, exposing login/logout functions, identity state, and login status via a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend interactions including fetching products, managing the cart (add, remove, update quantity), and checkout.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, CSS custom properties for light/dark theme color tokens, and reusable component utility classes for the StyleMart app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page with a back-navigation button and the Cart component inside a full-screen layout.",
  "frontend/src/pages/Catalog.tsx": "Product catalog page featuring a hero banner, search bar, category filter, and a product grid with a detail modal; filters products client-side based on search and category.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects delivery information via a form, displays an order summary from the cart, and calls the checkout mutation before navigating to a confirmation page.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays a post-purchase order confirmation page with a success icon, order processing/delivery info cards, and a 'Continue Shopping' button that navigates back to the home route.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, box shadows, font families (Inter/Nunito), and accordion keyframe animations, plus plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state (version 9) for a Flipkart-inspired online clothing store, including architectural notes, required product/brand images with dimensions, and a list of existing implemented features."
}