{
  "backend/main.mo": "Motoko actor implementing a dairy e-commerce backend with product management (add, list) and shopping cart operations (add, remove, clear, get, checkout) using Maps and Lists, keyed by Principal for user-specific carts.",
  "feature_evidence.json": "Feature evidence report documenting two completed branding updates: changing application name from 'Fresh Dairy Market' to 'DairyDelight' in Header.tsx and index.html, with high confidence test coverage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure, including routing, components, hooks, pages, and styling for a dairy e-commerce platform branded as 'DairyDelight'.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining design tokens for light and dark modes, including primary, secondary, muted, accent, destructive, and chart colors with sidebar variants.",
  "frontend/index.html": "HTML entry point with page title 'DairyDelight', viewport meta tag, and root div for mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application using TanStack Router to define routes (catalog, cart, checkout, confirmation) within a Layout component that includes Header, Footer, and Toaster.",
  "frontend/src/components/Cart.tsx": "Shopping cart component displaying cart items with CartItem components, total price calculation, empty state with call-to-action, and checkout navigation button.",
  "frontend/src/components/CartItem.tsx": "Individual cart item component with product image, name, price, quantity controls (increase/decrease/remove), and total price display using backend mutation hooks.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright for 'Fresh Dairy Market' and attribution link to caffeine.ai with UTM tracking parameters based on hostname.",
  "frontend/src/components/Header.tsx": "Responsive header with 'DairyDelight' branding (milk emoji logo), navigation links, shopping cart icon with item count badge, and mobile menu using Sheet component.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, price, and add-to-cart button with loading/success states and toast notifications.",
  "frontend/src/components/ProductGrid.tsx": "Displays a responsive grid of products fetched via useGetAllProducts hook, showing skeleton loaders during loading and an empty state message when no products are available.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching products, managing cart (get, add, remove), calculating cart total, and processing checkout.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom farm-inspired color palette using OKLCH color space for both light and dark modes, plus base styles for accessibility and smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page with a back button to continue shopping and displays the Cart component within a centered container layout.",
  "frontend/src/pages/Catalog.tsx": "Main catalog page featuring a hero section with farm-themed banner image and heading, followed by a ProductGrid displaying all available dairy products.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with order summary and delivery information form that validates input, processes checkout via mutation, and navigates to confirmation page on success.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page displaying success message with checkmark icon and a button to return to the catalog for continued shopping.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors, spacing, animations) with OKLCH color system, container settings, and plugins for typography and animations.",
  "project_state.json": "Project state file for DairyDelight, a mobile-responsive e-commerce web application for selling dairy products. Tracks 7 completed features (product catalog, shopping cart, checkout, mobile design, branding) and 1 pending feature request to update hero banner text."
}