{
  "backend/main.mo": "Motoko actor implementing a dairy marketplace backend with product management (add, list) and shopping cart operations (add, remove, clear, get, checkout) using Map and List data structures, keyed by Principal for user-specific carts.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: product catalog, shopping cart, checkout process, mobile responsiveness, and farm-inspired visual theme, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, pages, hooks, routing, and styling for the dairy marketplace application.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system with farm-inspired natural tones for light and dark modes, including custom CSS variables for UI components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with four routes (catalog, cart, checkout, confirmation) wrapped in a layout with header, footer, and toast notifications.",
  "frontend/src/components/Cart.tsx": "Shopping cart component displaying cart items with total price calculation, empty state with call-to-action, and checkout navigation button.",
  "frontend/src/components/CartItem.tsx": "Individual cart item component with product image, quantity controls (increase/decrease/remove), price display, and mutation handling with toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with UTM tracking parameters based on hostname.",
  "frontend/src/components/Header.tsx": "Navigation header component with logo, cart icon showing item count, and responsive mobile/desktop menus using Sheet component.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, and price with an 'Add to Cart' button that shows success feedback.",
  "frontend/src/components/ProductGrid.tsx": "Grid layout component that fetches and displays all products using ProductCard components, with loading skeletons and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching products, cart data, cart total, and mutations for adding/removing items and checkout operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom farm-inspired color palette for light/dark modes and base styling for touch-friendly UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page with back navigation button and Cart component wrapper in a centered layout.",
  "frontend/src/pages/Catalog.tsx": "Main catalog page with hero banner section and ProductGrid displaying all available dairy products.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with order summary and delivery information form that processes orders and navigates to confirmation on success.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page component that displays a success message with a checkmark icon, order details, and a button to continue shopping.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, typography, animations, and plugins for the dairy marketplace application.",
  "project_state.json": "Project metadata tracking the dairy marketplace application's features, requirements, and architectural notes including product catalog, shopping cart, checkout, and mobile-responsive design."
}